; domain
;; Domain for robot navigation between waypoints
(define (domain waypoint-navigation)
  (:requirements :strips :typing)
  
  (:types 
    robot waypoint - object
  )
  
  (:predicates 
    (robot-at ?r - robot ?w - waypoint)
    (connected ?w1 - waypoint ?w2 - waypoint)
    (visited ?w - waypoint)
  )
  
  (:action move
    :parameters (?r - robot ?from - waypoint ?to - waypoint)
    :precondition (and 
      (robot-at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and 
      (not (robot-at ?r ?from))
      (robot-at ?r ?to)
      (visited ?to)
    )
  )
)

; problem
;; Problem: Robot navigation through multiple waypoints
(define (problem waypoint-navigation-problem)
  (:domain waypoint-navigation)
  
  (:objects 
    robot1 - robot
    wp1 wp2 wp3 wp4 wp5 - waypoint
  )
  
  (:init 
    ;; Robot initial position
    (robot-at robot1 wp1)
    
    ;; Initial visited waypoint
    (visited wp1)
    
    ;; Waypoint connections (bidirectional)
    (connected wp1 wp2)
    (connected wp2 wp1)
    (connected wp2 wp3)
    (connected wp3 wp2)
    (connected wp3 wp4)
    (connected wp4 wp3)
    (connected wp4 wp5)
    (connected wp5 wp4)
    (connected wp1 wp3)
    (connected wp3 wp1)
    (connected wp2 wp5)
    (connected wp5 wp2)
  )
  
  (:goal 
    (and 
      (robot-at robot1 wp5)
      (visited wp2)
      (visited wp3)
      (visited wp4)
    )
  )
)

; plan
1. (move robot1 wp1 wp2)
   deleted: (robot-at robot1 wp1)
   added: (robot-at robot1 wp2) (visited wp2)
   goals met: 1 of 4
2. (move robot1 wp2 wp3)
   deleted: (robot-at robot1 wp2)
   added: (robot-at robot1 wp3) (visited wp3)
   goals met: 2 of 4
3. (move robot1 wp3 wp4)
   deleted: (robot-at robot1 wp3)
   added: (robot-at robot1 wp4) (visited wp4)
   goals met: 3 of 4
4. (move robot1 wp4 wp5)
   deleted: (robot-at robot1 wp4)
   added: (robot-at robot1 wp5) (visited wp5)
   goals met: 4 of 4
